In [6]:
import pandas as pd
import os
os.listdir('./datasets/titanic')

['gender_submission.csv',
 'test.csv',
 'train-left-down.csv',
 'train-left-up.csv',
 'train-right-down.csv',
 'train-right-up.csv',
 'train.csv']

In [7]:
data_file_ld = "./datasets/titanic/train-left-down.csv"
data_file_lu = "./datasets/titanic/train-left-up.csv"
data_file_rd = "./datasets/titanic/train-right-down.csv"
data_file_ru = "./datasets/titanic/train-right-up.csv"
df_ld = pd.read_csv(data_file_ld)
df_lu = pd.read_csv(data_file_lu)
df_rd = pd.read_csv(data_file_rd)
df_ru = pd.read_csv(data_file_ru)
df_ld.head(3)

   PassengerId  Survived  Pclass                                         Name
0          440         0       2       Kvillner, Mr. Johan Henrik Johannesson
1          441         1       2  Hart, Mrs. Benjamin (Esther Ada Bloomfield)
2          442         0       3                              Hampe, Mr. Leon

In [11]:
df_rd.head(3)

      Sex   Age  SibSp  Parch        Ticket   Fare Cabin Embarked
0    male  31.0      0      0    C.A. 18723  10.50   NaN        S
1  female  45.0      1      1  F.C.C. 13529  26.25   NaN        S
2    male  20.0      0      0        345769   9.50   NaN        S

In [8]:
df_lu.head(3)

,PassengerId,Survived,Pclass,Name
0,1,0,3,"Braund, Mr. Owen Harris"
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th..."
2,3,1,3,"Heikkinen, Miss. Laina"

In [10]:
df_ru.head(3)

      Sex   Age  SibSp  Parch            Ticket     Fare Cabin Embarked
0    male  22.0      1      0         A/5 21171   7.2500   NaN        S
1  female  38.0      1      0          PC 17599  71.2833   C85        C
2  female  26.0      0      0  STON/O2. 3101282   7.9250   NaN        S

In [12]:
result_up = pd.concat([df_lu, df_ru], axis=1)
result_up.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S

In [13]:
result_down = df_ld.join(df_rd)
result_down.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,440,0,2,"Kvillner, Mr. Johan Henrik Johannesson",male,31.0,0,0,C.A. 18723,10.50,NaN,S
1,441,1,2,"Hart, Mrs. Benjamin (Esther Ada Bloomfield)",female,45.0,1,1,F.C.C. 13529,26.25,NaN,S
2,442,0,3,"Hampe, Mr. Leon",male,20.0,0,0,345769,9.50,NaN,S

In [16]:
result = result_up.append(result_down)
len(result), len(result_up), len(result_down)

(891, 439, 452)

In [17]:
result.to_csv("./datasets/titanic/result.csv")

In [18]:
result.stack()  # stack将dataframe转化为Series

0    PassengerId                          1
     Survived                             0
     Pclass                               3
     Name           Braund, Mr. Owen Harris
     Sex                               male
                             ...
451  SibSp                                0
     Parch                                0
     Ticket                          370376
     Fare                              7.75
     Embarked                             Q
Length: 9826, dtype: object

In [19]:
result.stack().head(20)

0  PassengerId                                                    1
   Survived                                                       0
   Pclass                                                         3
   Name                                     Braund, Mr. Owen Harris
   Sex                                                         male
   Age                                                           22
   SibSp                                                          1
   Parch                                                          0
   Ticket                                                 A/5 21171
   Fare                                                        7.25
   Embarked                                                       S
1  PassengerId                                                    2
   Survived                                                       1
   Pclass                                                         1
   Name           Cumings, Mrs. John Bradley (Florence Briggs Th...
   Sex                                                       female
   Age                                                           38
   SibSp                                                          1
   Parch                                                          0
   Ticket                                                  PC 17599
dtype: object

计算泰坦尼克号男性与女性的平均票价

In [20]:
result.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 891 entries, 0 to 451
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 110.5+ KB

In [22]:
result.groupby('Sex').get_group("male")

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
444,884,0,2,"Banfield, Mr. Frederick James",male,28.0,0,0,C.A./SOTON 34068,10.5000,NaN,S
445,885,0,3,"Sutehall, Mr. Henry Jr",male,25.0,0,0,SOTON/OQ 392076,7.0500,NaN,S
447,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
450,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
451,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [24]:
result.groupby('Sex').get_group("male")['Fare'].describe()  # 男性平均票价为25.52

count    577.000000
mean      25.523893
std       43.138263
min        0.000000
25%        7.895800
50%       10.500000
75%       26.550000
max      512.329200
Name: Fare, dtype: float64

In [25]:
result.groupby('Sex')["Fare"].mean()  # 女性平均票价为44.48

Sex
female    44.479818
male      25.523893
Name: Fare, dtype: float64

In [27]:
result.groupby('Sex')["Survived"].sum()  # 男女性别存活人数

Sex
female    233
male      109
Name: Survived, dtype: int64

In [31]:
result.groupby('Sex')["Survived"].sum() / result.groupby('Sex')["Survived"].count()  # 男女性别存活率

Sex
female    0.742038
male      0.188908
Name: Survived, dtype: float64

In [28]:
result.groupby('Pclass')["Survived"].sum()  # 客舱不同等级的存活人数

Pclass
1    136
2     87
3    119
Name: Survived, dtype: int64

In [30]:
result.groupby('Pclass')["Survived"].sum() / result.groupby('Pclass')["Survived"].count()  # 客舱不同等级的存活率

Pclass
1    0.629630
2    0.472826
3    0.242363
Name: Survived, dtype: float64

In [32]:
result.groupby('Survived').agg({'Sex': 'mean', 'Pclass': 'count'})

DataError: No numeric types to aggregate

统计在不同等级的票中的不同年龄的船票花费的平均值

自变量有两个，Pclass、Age

因变量是Fare，求Fare的mean

In [34]:
result.groupby(["Pclass", "Age"])["Fare"].mean()

Pclass  Age
1       0.92     151.5500
        2.00     151.5500
        4.00      81.8583
        11.00    120.0000
        14.00    120.0000
                   ...
3       61.00      6.2375
        63.00      9.5875
        65.00      7.7500
        70.50      7.7500
        74.00      7.7750
Name: Fare, Length: 182, dtype: float64

得出不同年龄的总的存活人数，然后找出存活人数的最高的年龄，最后计算存活人数最高的存活率（存活人数/总人数）

In [39]:
result.groupby('Age')['Survived'].sum().sort_values(ascending=False)  # 24岁存活最多，15个

Age
24.0    15
22.0    11
36.0    11
35.0    11
27.0    11
        ..
74.0     0
30.5     0
28.5     0
20.5     0
10.0     0
Name: Survived, Length: 88, dtype: int64

In [45]:
15 / result['Survived'].sum()

0.043859649122807015